{
  "hi": "Hallo ,",
  "name": "Ich bin Ali Zare",
  "jobTitle": "Softwareingenieur",
  "jobInfo": "Senior Frontend-Entwickler",
  "workExperiences": "Berufserfahrung",
  "workSummeryInfo": "Ich habe mehr als 9 Jahre Berufserfahrung",
  "charismaJobTitle": "Senior Frontend-Entwickler bei Charisma Financial Group",
  "charismaJobDate": "Nov 2023 - Gegenwart",
  "charismaJobInfo": [
    "Neu gestaltet Charismas Website und Geschenkkartensystem mit React und Next.js, Erhöhung der Kundenbindung um 30 % und der Geschenkkartenverkäufe um 20 %.",
    "Überarbeitet die Codebasis-Struktur und Anwendungsarchitektur und reduzierte die monatliche Debugging-Zeit um 30 Stunden.",
    "Entwicklung von sauberem, modularem Code basierend auf Best Practices, Reduzierung zukünftiger Fehler um 35 %.",
    "Optimierte Ladezeiten um 45 % durch Code-Splitting und Lazy Loading-Techniken."
  ],
  "tseJobTitle": "Senior Frontend-Entwickler bei der Teheraner Börse",
  "tseJobDate": "Apr 2020 - Nov 2023",
  "tseJobInfo": [
    "Leitung des Frontend-Teams bei der Einführung von React und Next.js, Steigerung der Bereitstellungshäufigkeit um 40 %.",
    "Implementierte Monorepo-Architektur zur Reduzierung von Code-Duplikationen und Steigerung der Teamproduktivität.",
    "Verbesserte Ladegeschwindigkeit der Seiten um 60 % und reduzierte den Code-Umfang um 25 % mit Next.js",
    "Beschleunigte Backend-Antwortzeiten um 35 % für schnelleren Zugriff auf Finanzdaten."
  ],
  "baniJobTitle": "Frontend (Mobile) Entwickler bei Banimode",
  "baniJobDate": "Jan 2020 - Apr 2020",
  "baniJobInfo": [
    "Entwickelte und wartete die Banimode Mobile-App mit React Native, Verringerung der Absturzrate um 40 % und Verbesserung der Benutzerfreundlichkeit um 25 %."
  ],
  "stJobTitle": "Frontend (Mobile) Entwickler bei First Eurasia E-Commerce",
  "stJobDate": "Juli 2018 - Jan 2020 ",
  "stJobInfo": [
    "Leitung eines funktionsübergreifenden Teams zur Entwicklung von Multi-Plattform-FinTech- und CRM-Anwendungen, Erhöhung des Benutzerengagements um 40 % und Verkürzung der Entwicklungszeit um 25 %.",
    "Implementierte responsive Designs für verbesserte Benutzerfreundlichkeit und Kompatibilität auf verschiedenen Geräten.",
    "Integrierte Echtzeit-Datensynchronisierung und Analysen, Verbesserung der Benutzererfahrung und datengetriebene Interaktionen ermöglicht."
  ],
  "expertise": "Fachwissen",
  "skills": "Fähigkeiten",
  "softSkills": "Weiche Fähigkeiten",
  "qualification": "Qualifikation",
  "educations": "Bildung",
  "eduTitle": "Software Engineering",
  "masterTitle": "Master (MSc/MA) - Islamische Azad-Universität, Wissenschafts- und Forschungszweig",
  "masterDate": "2014 - 2016 , Teheran",
  "bachelorTitle": "Bachelor (BSc/BA) - Amol Institut für höhere Bildung",
  "bachelorDate": "2012 - 2014 , Mazandaran, Amol",
  "associateTitle": "Assoziierter Abschluss - Technisches Institut von Behshahr - Imam Khomeini",
  "associateDate": "2009 - 2012 , Mazandaran, Behshahr",
  "aboutTitle": "Jenseits des Codes",
  "about": "Ich liebe Abenteuer. Bisher habe ich das Theater und Gleitschirmfliegen zum Spaß erlebt. Aber ich möchte in Zukunft professionell fliegen. Ich mag auch Sprünge und verrückte Spiele in großen Höhen. In der Tat liebe ich die Natur, Waldklettern, Berge, Meer usw., weil die Natur mir Frieden gibt. In meiner Freizeit beschäftige ich mich auch mit den oben genannten Aktivitäten, schaue Filme, spiele Spiele (z. B. Kartfahren, Bowling, Paintball usw.). Ich interessiere mich sehr für Selbsterkenntnis und Philosophie und bemühe mich um meine persönliche Entwicklung.",
  "stNetJobTitle": "Netzwerkingenieur bei First Eurasia E-Commerce",
  "stNetJobDate": "JUL 2017 - JUL 2018",
  "stNetJobInfo": "Verwaltung von über 10 Servern in einer Windows-Server-Umgebung und Unterstützung von über 100 Kunden. Arbeit mit Mikrotik, Switch. Kenntnisse in Diagnose, Reparatur und Debugging von Software- und Computersystemen.",
  "freeJobTitle": "Netzwerkadministrator bei iNet (Mein Unternehmen)",
  "freeJobDate": "MAR 2014 - MAY 2017",
  "freeJobInfo": "Netzwerkadministrator und Support sowie Reparatur und Debugging von Software- und Computersystemen in mehreren Unternehmen.",
  "problemSolving": "Problemlösung",
  "criticalThinking": "Kritisches Denken",
  "communication": "Kommunikationsfähigkeiten",
  "leadership": "Führungsqualitäten",
  "selfLearning": "Selbstlernen",
  "accountability": "Verantwortungsbewusstsein",
  "adaptability": "Anpassungsfähigkeit",
  "mentoring": "Mentoring",
  "flexibility": "Flexibilität",
  "call": "Anruf mich",
  "cv": "Lebenslauf erhalten",
  "summary": "Qualifizierter Frontend-Entwickler mit über 7 Jahren Erfahrung und Spezialisierung auf JavaScript, TypeScript und moderne Frameworks wie React und Next.js. Erfahrung in der Verbesserung der Codequalität und Förderung technischer Transformationen in verschiedenen Projekten. Nachweisliche Fähigkeit, Frontend-Architekturen neu zu gestalten und Leistungsoptimierungen zur Unterstützung des Geschäftswachstums durchzuführen. Bekannt für die Erstellung intuitiver, leistungsstarker UIs und die Leitung funktionsübergreifender Teams zur Erzielung bedeutender Ergebnisse. Nachgewiesene Erfolge bei der Verbesserung der Benutzerfreundlichkeit und Optimierung der Leistung, mit einem starken Engagement für kontinuierliches Lernen und die Bereitstellung hochwertiger, skalierbarer Lösungen.",
  "aboutMe": "Über Mich",
  "whyProgrammingTitle": "Warum Programmieren?",
  "whyProgrammingText": "Schon als Teenager war ich von Computern fasziniert. Diese Leidenschaft führte mich dazu, eine technische Schule zu besuchen und Informatik zu studieren – ein Weg, den ich bis zum Masterabschluss fortgesetzt habe. Meine erste Programmiererfahrung machte ich mit Visual Basic in der Schulzeit – ich erinnere mich noch gut daran, wie ich mein erstes Projekt auf einer Diskette und einer CD abgegeben habe! Ich begann mit kleinen Aufgaben wie dem Installieren von Windows oder dem Zusammenbauen von PCs und arbeitete mich später in technischere Bereiche wie Netzwerke ein. Schließlich kehrte ich zu dem zurück, was ich wirklich liebe: Programmieren. Ich war nie ein Mathe-Genie, deshalb löse ich Probleme lieber einfach und praxisorientiert – mit unnötiger Komplexität konnte ich mich noch nie anfreunden.  Ich liebe es, Dinge zu erschaffen und kreative Lösungen zu finden. Es gibt kaum etwas Schöneres, als zu sehen, wie aus dem Nichts etwas entsteht. Heute, nach vielen Jahren praktischer Erfahrung, ist Programmieren für mich mehr als nur ein Beruf – es ist eine Denkweise – eine Mischung aus Logik, Kreativität und Geduld."
}
