{
  "hi": "Hello ,",
  "name": "Im Ali Zare",
  "jobTitle": "Software Engineer",
  "jobInfo": "Senior Frontend Developer",
  "workExperiences": "Work Experiences",
  "workSummeryInfo": "I have more than 9 years of work experience",
  "charismaJobTitle": "Senior Frontend Developer at Charisma Financial Group",
  "charismaJobDate": "Nov 2023 - Present",
  "charismaJobInfo": [
    "Redesigned Charisma’s website and gift card system using React and Next.js, increasing customer retention by 30% and gift card sales by 20%.",
    "Revamped the codebase structure and application architecture, reducing debugging time by 30 hours monthly",
    "Developed clean, modular code based on best practices, reducing future errors by 35%",
    "Optimized load times by 45% through code-splitting and lazy loading techniques."
  ],
  "tseJobTitle": "Senior Frontend Developer at Tehran Stock Exchange",
  "tseJobDate": "Apr 2020 - Nov 2023",
  "tseJobInfo": [
    "Led frontend team in adopting React and Next.js, boosting deployment frequency by 40%.",
    "Implemented Monorepo architecture to reduce code duplication and enhance team productivity.",
    "Enhanced page load speeds by 60% and reduced code size by 25% with Next.js",
    "Accelerated backend response times by 35%, enabling faster access to financial data for users."
  ],
  "baniJobTitle": "Frontend (Mobile) Developer at Banimode",
  "baniJobDate": "Jan 2020 - Apr 2020",
  "baniJobInfo": [
    "Developed and maintained the Banimode mobile app with React Native, decreasing crash rates by 40% and enhancing usability by 25%."
  ],
  "stJobTitle": "Frontend (Mobile) Developer at First Eurasia E-Commerce",
  "stJobDate": "July 2018 - Jan 2020 ",
  "stJobInfo": [
    "Led a cross-functional team to develop multi-platform FinTech and CRM applications, increasing user engagement by 40% and reducing development time by 25%.",
    "Implemented responsive design for improved UX and compatibility across devices.",
    "Integrated real-time data synchronization and analytics tools, enhancing user experience and enabling data-driven interactions."
  ],
  "expertise": "Expertise",
  "skills": "Skills",
  "qualification": "Qualification",
  "educations": "Educations",
  "eduTitle": "Software Engineering",
  "masterTitle": "Master (MSc/MA) - Islamic Azad University Science and Research Branch",
  "masterDate": "2014 - 2016 , Tehran",
  "bachelorTitle": "Bachelor(BSc/BA) - Amol Institute of Higher Education ",
  "bachelorDate": "2012 - 2014 , Mazandaran, Amol",
  "associateTitle": "Associate - Technical Institute Of Behshahr - Imam Khomeini",
  "associateDate": "2009 - 2012 , Mazandaran, Behshahr",
  "about": "I love adventure. So far, I have experienced the theater and paraglider flight for fun. But I would like to start flying professionally in the future. And I also like jumping and crazy games at heights. Indeed, I love nature, forest climbing, mountain, sea, etc., because nature gives me peace. My free time is also busy with the above, watching movies, playing games (for example, karting, bowling, paintball, etc.). And that I am very interested in learning about self-knowledge and philosophy and I am trying for my personal development.",
  "stNetJobTitle": "Network Engineer at First Eurasia E-Commerce",
  "stNetJobDate": "JUL 2017 - JUL 2018",
  "stNetJobInfo": "Administer 10+ servers in a windows server environment and support +100 clients. worked with Mikrotik, Switch. Working knowledge of the diagnosis, repair & debugging of software & computer systems",
  "freeJobTitle": "Network Administrator at iNet (My Company)",
  "freeJobDate": "MAR 2014 - MAY 2017",
  "freeJobInfo": "Network administrator and support and repair & debugging of software & computer systems in several companies.",
  "softSkill1": "Problem-solving skills and critical thinking",
  "softSkill2": "Communication skills",
  "softSkill3": "Leadership Skills",
  "softSkill4": "Self-learning",
  "softSkill5": "Accountability",
  "softSkill6": "Adaptability",
  "softSkill7": "Time management",
  "softSkill8": "Emotional intelligence",
  "softSkill9": "Mentoring",
  "call": "Call Me",
  "cv": "Get CV",
  "summary": "Skilled frontend developer with over 6 years of experience specializing in JavaScript, TypeScript, and modern frameworks like React and Next.js. Experienced in enhancing code quality and driving technical transformations across multiple projects. Demonstrated ability to lead front-end architecture redesigns and performance optimizations to support business growth. Known for creating intuitive, high-performance UIs and leading cross-functional teams to achieve significant results. Proven record of enhancing UX and optimizing performance, with a deep commitment to continuous learning and delivering high-quality, scalable solutions.",
  "aboutMe" :"About Me"
}
