{
  "hi": "Hello",
  "name": "Im Ali Zare",
  "jobTitle": "Software Engineer",
  "jobInfo": "Senior Frontend Developer | Blockchain and Machine Learning Researcher",
  "workExperiences": "Work Experiences",
  "workSummeryInfo": "I have more than 8 years of work experience",
  "tseJobTitle": "Frontend Developer at Tehran Stock Exchange",
  "tseJobDate": "Apr 2020 - Present",
  "tseJobInfo": "We are currently working on multiple web application projects by React js and Next js that belong to Tehran Stock Exchange.And I was the leader of the Frontend development team for these projects.",
  "baniJobTitle": "Frontend (Mobile) Developer at Banimode",
  "baniJobDate": "Jan 2020 - Apr 2020",
  "baniJobInfo": "Banimode online store is active in the field of clothing, beauty and health, home appliances, and food. We implemented the mobile project of the Banimode store by React Native.",
  "stJobTitle": "Frontend (Mobile) Developer at First Eurasia E-Commerce",
  "stJobDate": "July 2018 - Jan 2020 ",
  "stJobInfo": "We have Implemented projects in the Fintech fields for business's named PoolKhord and CRM  Payamgostar . as well as this projects built in Android , Web , PWA and Desktop (Windows , Mac OS , Linux) by React Native and with the same code base. And I was the leader of the Frontend development team for these projects. You can find and view this projects on www.poolkhord.com and www.payamgostar.com",
  "expertise": "Expertise",
  "skills": "Skills",
  "qualification": "Qualification",
  "educations": "Educations",
  "eduTitle": "Software Engineering",
  "masterTitle": "Master (MSc/MA) - Islamic Azad University Science and Research Branch",
  "masterDate": "2014 - 2016 , Tehran",
  "bachelorTitle": "Bachelor(BSc/BA) - Amol Institute of Higher Education ",
  "bachelorDate": "2012 - 2014 , Mazandaran, Amol",
  "associateTitle": "Associate - Technical Institute Of Behshahr - Imam Khomeini",
  "associateDate": "2009 - 2012 , Mazandaran, Behshahr",
  "about": "I love adventure. So far, I have experienced the theater and paraglider flight for fun. But I would like to start flying professionally in the future. And I also like jumping and crazy games at heights. Indeed, I love nature, forest climbing, mountain, sea, etc., because nature gives me peace. My free time is also busy with the above, watching movies, playing games (for example, karting, bowling, paintball, etc.). And that I am very interested in learning about self-knowledge and philosophy and I am trying for my personal development.",
  "stNetJobTitle": "Network Engineer at First Eurasia E-Commerce",
  "stNetJobDate": "JUL 2017 - JUL 2018",
  "stNetJobInfo": "Administer 10+ servers in a windows server environment and support +100 clients. worked with Mikrotik, Switch. Working knowledge of the diagnosis, repair & debugging of software & computer systems",
  "freeJobTitle" : "Network Administrator at iNet (My Company)",
  "freeJobDate": "MAR 2014 - MAY 2017",
  "freeJobInfo": "Network administrator and support and repair & debugging of software & computer systems in several companies."
}
