{
  "hi": "سلام ،",
  "name": "من علی زارع هستم",
  "jobTitle": "مهندس نرم فزار",
  "jobInfo": "توسعه دهند ارشد فرانت اند | محقق بلاک چین",
  "workExperiences": "تجربیات کاری",
  "workSummeryInfo": "من بیش از 8 سال تجربه کاری دارم.",
  "tseJobTitle": "توسعه دهنده فرانت اند - بورس اوراق بهادار تهران",
  "tseJobDate": "فروردین 1399 - اکنون",
  "tseJobInfo": "من اولین شخص بودم که در این شرکت فناوری‌های React JS و Next JS را معرفی و استفاده کردم. با استفاده از React JS و Next JS، توانستم عملکرد و بهبود پروژه‌های برنامه‌های وب را بهبود بخشم.  به عنوان رهبر تیم توسعه فرانت‌اند، فرایندهای توسعه و همکاری درون تیم را تسهیل کردم.  آموزش و راهنمایی لازم را به تیم در استفاده از React JS و Next JS، و همچنین پیاده‌سازی بهترین روش‌ها و الگوهای طراحی در توسعه نرم‌افزار ارائه دادم.",
  "baniJobTitle": "توسعه دهنده فرانت اند (موبایل) - بانی مد",
  "baniJobDate": "بهمن 1398 - فروردین 1399",
  "baniJobInfo": "در طی تجربه کاری خود در بانی‌مد، با استفاده از React Native، برنامه موبایل بانی‌مد را توسعه دادم. من با استفاده از Sentry، خطاهای برنامه را تجزیه و تحلیل کرده، باگ ها را در دستگاه های مختلف برطرف کرده و با استفاده از Firebase، تجربه کاربری را با مشاهده رفتار کاربران بهبود دادم. من راهکارهایی را به تیم تجربه کاربری ارائه دادم تا قابلیت استفاده برنامه را بهبود بخشند.",
  "stJobTitle": "توسعه دهنده فرانت (موبایل) - تجارت الکترونیک اول",
  "stJobDate": "مرداد 1397 - دی 1398",
  "stJobInfo": "در نقش خود در شرکت تجارت الکترونیک اول، به عنوان رهبر تیم فرانت-اند خدمات کرده‌ام و پروژه‌هایی مانند فینتک و مدیریت ارتباط با مشتری با استفاده از React Native را با موفقیت انجام دادم. این پروژه‌ها بر روی پلتفرم‌های مختلف از جمله موبایل، وب، دسکتاپ و PWA راه‌اندازی شده است. علاوه بر این، در این دوره سه کارآموز را راهنمایی و آموزش داده و با ارائه راهنمایی و حمایت، عملکرد و توسعه حرفه‌ای آن‌ها را بهبود بخشیدم.",
  "expertise": "تجربه و تخصص",
  "skills": "مهارت ها",
  "qualification": "مدارک",
  "educations": "آموزش ها",
  "eduTitle": "مهندسی نرم افزار",
  "masterTitle": "کارشناسی ارشد -  دانشگاه آزاد واحد علوم تحقیقات",
  "masterDate": "1393 تا 1395 - تهران",
  "bachelorTitle": "کارشناسی -  موسسه غیرانتفاعی آمل",
  "bachelorDate": "1390 تا 1392 - آمل",
  "associateTitle": "کاردانی - دانشکده فنی امام خمینی بهشهر",
  "associateDate": "1387 تا 1390 - بهشهر",
  "about": "من عاشق ماجراجویی هستم . تاکنون تئاتر رو تجربه کردم و همچینین پرواز با پاراگلایدر بصورت تفریحی . ولی دوست دارم در آینده پرواز را بصورت حرفه ای شروع  کنم . و همینطور جامپینگ و دیوونه بازی تو ارتفاع رو دوست دارم .  راستی من عاشق طبیعت هستم ، جنگل نوردی ، کوه ، دریا و...، چون طبیعت به من آرامش میده. اوقات فراغت خودم هم مشغول کارهای بالا و تماشای فیلم ، بازی (به عنوان مثال کارتینگ ، بولینگ ، پینتبال و ...). و اینکه من علاقه زیادی به مطالعه در زمینه خودشناسی و فلسفه دارم و برای رشد و توسعه فردی تلاش میکنم.",
  "stNetJobInfo": "مدیریت بیش از 10 سرور در محیط سرور ویندوز و پشتیبانی از +100 کاربر. کار با میکروتیک، سوئیچ . دانش کار در زمینه تشخیص، تعمیر و اشکال زدایی نرم افزار و سیستم های کامپیوتری.",
  "stNetJobTitle": "کارشناس شبکه - تجارت الکترونیک اول",
  "stNetJobDate": "تیر ۱۳۹۶ - تیر۱۳۹۷",
  "freeJobTitle": "ادمین شبکه - آی نت (شرکت خودم)",
  "freeJobDate": "فرودین ۱۳۹۳ - خرداد ۱۳۹۶",
  "freeJobInfo": "مدیر شبکه و پشتیبانی و تعمیر و رفع اشکال نرم افزار و سیستم های کامپیوتری در چندین شرکت.",
  "softSkill1": "مهارت حل مسئله و تفکر انتقادی",
  "softSkill2": "مهارت های ارتباطی",
  "softSkill3": "مهارت های رهبری",
  "softSkill4": "خودآموزی",
  "softSkill5": "مسئوليت پذیری",
  "softSkill6": "تطبیق پذیری",
  "softSkill7": "مدیریت زمان",
  "softSkill8": "هوش هیجانی",
  "softSkill9": "منتورینگ و راهنمایی کردن",
  "call": "تماس با ما",
  "cv": "دانلود رزومه",
  "summary": "من یک توسعه‌دهنده فرانت‌اند با بیش از 5 سال سابقه کار در این حوزه هستم. تخصص من در زمینه‌های جاوااسکریپت و تایپ‌اسکریپت است و توانسته‌ام از این زبان‌ها در پروژه‌های مختلف استفاده کنم. علاوه بر این، تجربه قوی در کار با فریمورک‌های React و Next.js دارم و با استفاده از این ابزارها توانسته‌ام رابط‌های کاربری جذاب و کارآمدی ایجاد کنم. در طول حرفه‌ام، به عنوان رهبر تیم توسعه فرانت‌اند در چندین پروژه فعالیت کرده‌ام و با موفقیت تیم‌های توسعه چندگانه را هماهنگ کرده و به عنوان رهبر تیم عمل کرده‌ام. من دارای مهارت‌های ارتباطی و همکاری عالی با طراحان، توسعه‌دهندگان بک‌اند و مدیران پروژه هستم و همیشه اولویت می‌دهم کیفیت و عملکرد برنامه‌ها را رعایت کنم. علاوه بر این، همواره در حال یادگیری و بهبود مهارت‌های خود هستم تا در تیم‌ها و پروژه‌های آینده بهترین عملکرد را ارائه دهم. و همینطور من به فعالیت در حوزه برنامه نویسی بلاکچین علافه‌مند هستم و در حال حاضر در حال یادگیری زبان سالیدیتی و نوشتن قراردادهای هوشمند هستم."
}
